app/views/restaurants/show.html.erb

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 76]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 76]]
---
  <div class="restaurant-reviews">
  <% if @restaurant.reviews.empty? %>