app/controllers/home_controller.rb

  def index
    long = params["long"]
    lat = params["lat"]
    geo_localization = "#{lat},#{long}"
    query = Geocoder.search(geo_localization).first
    if query.present? && request.xhr?
      puts "QUERY PRESENT!!!"
      @postal_code = query.postal_code
      @r_workability = Restaurant.sort_by_workability(@postal_code).first(6)
---
SELECT "restaurants".* FROM "restaurants" WHERE (address LIKE '%92101')