app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("outlet_rating", "wifi_rating", "seating_rating", "parking_rating", "atmosphere_rating", "comments", "restaurant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @review = Review.new(review_params)
    @review.restaurant_id = params[:restaurant_id]
    @review.user_id = session[:user_id]
    if @review.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @review = Restaurant.find(params[:restaurant_id]).reviews.new

UPDATE "reviews" SET "comments" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comments", "ddddddd"], ["updated_at", "2016-12-08 23:14:07.274132"], ["id", 8]]
---
  def update
    if @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 5]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy