app/controllers/users_controller.rb

  def validate
    @user = User.find_by(email: params["user"]["email"])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "yyyy"]]

  def profile
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]